MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAA176/mcu.h
#define _GLCDCLUT208_BLUE_POSITION               0x00000000
#define _GLCDCLUT208_BLUE_MASK                   0x000000FF
#define _GLCDCLUT208_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT208_GREEN_POSITION              0x00000008
#define _GLCDCLUT208_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT208_GREEN_LENGTH                0x00000008

#define _GLCDCLUT208_RED_POSITION                0x00000010
#define _GLCDCLUT208_RED_MASK                    0x00FF0000
#define _GLCDCLUT208_RED_LENGTH                  0x00000008

#define _GLCDCLUT209_BLUE_POSITION               0x00000000
#define _GLCDCLUT209_BLUE_MASK                   0x000000FF
#define _GLCDCLUT209_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT209_GREEN_POSITION              0x00000008
#define _GLCDCLUT209_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT209_GREEN_LENGTH                0x00000008

#define _GLCDCLUT209_RED_POSITION                0x00000010
#define _GLCDCLUT209_RED_MASK                    0x00FF0000
#define _GLCDCLUT209_RED_LENGTH                  0x00000008

#define _GLCDCLUT210_BLUE_POSITION               0x00000000
#define _GLCDCLUT210_BLUE_MASK                   0x000000FF
#define _GLCDCLUT210_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT210_GREEN_POSITION              0x00000008
#define _GLCDCLUT210_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT210_GREEN_LENGTH                0x00000008

#define _GLCDCLUT210_RED_POSITION                0x00000010
#define _GLCDCLUT210_RED_MASK                    0x00FF0000
#define _GLCDCLUT210_RED_LENGTH                  0x00000008

#define _GLCDCLUT211_BLUE_POSITION               0x00000000
#define _GLCDCLUT211_BLUE_MASK                   0x000000FF
#define _GLCDCLUT211_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT211_GREEN_POSITION              0x00000008
#define _GLCDCLUT211_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT211_GREEN_LENGTH                0x00000008

#define _GLCDCLUT211_RED_POSITION                0x00000010
#define _GLCDCLUT211_RED_MASK                    0x00FF0000
#define _GLCDCLUT211_RED_LENGTH                  0x00000008

#define _GLCDCLUT212_BLUE_POSITION               0x00000000
#define _GLCDCLUT212_BLUE_MASK                   0x000000FF
#define _GLCDCLUT212_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT212_GREEN_POSITION              0x00000008
#define _GLCDCLUT212_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT212_GREEN_LENGTH                0x00000008

#define _GLCDCLUT212_RED_POSITION                0x00000010
#define _GLCDCLUT212_RED_MASK                    0x00FF0000
#define _GLCDCLUT212_RED_LENGTH                  0x00000008

#define _GLCDCLUT213_BLUE_POSITION               0x00000000
#define _GLCDCLUT213_BLUE_MASK                   0x000000FF
#define _GLCDCLUT213_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT213_GREEN_POSITION              0x00000008
#define _GLCDCLUT213_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT213_GREEN_LENGTH                0x00000008

#define _GLCDCLUT213_RED_POSITION                0x00000010
#define _GLCDCLUT213_RED_MASK                    0x00FF0000
#define _GLCDCLUT213_RED_LENGTH                  0x00000008

#define _GLCDCLUT214_BLUE_POSITION               0x00000000
#define _GLCDCLUT214_BLUE_MASK                   0x000000FF
#define _GLCDCLUT214_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT214_GREEN_POSITION              0x00000008
#define _GLCDCLUT214_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT214_GREEN_LENGTH                0x00000008

#define _GLCDCLUT214_RED_POSITION                0x00000010
#define _GLCDCLUT214_RED_MASK                    0x00FF0000
#define _GLCDCLUT214_RED_LENGTH                  0x00000008

#define _GLCDCLUT215_BLUE_POSITION               0x00000000
#define _GLCDCLUT215_BLUE_MASK                   0x000000FF
#define _GLCDCLUT215_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT215_GREEN_POSITION              0x00000008
#define _GLCDCLUT215_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT215_GREEN_LENGTH                0x00000008

#define _GLCDCLUT215_RED_POSITION                0x00000010
#define _GLCDCLUT215_RED_MASK                    0x00FF0000
#define _GLCDCLUT215_RED_LENGTH                  0x00000008

#define _GLCDCLUT216_BLUE_POSITION               0x00000000
#define _GLCDCLUT216_BLUE_MASK                   0x000000FF
#define _GLCDCLUT216_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT216_GREEN_POSITION              0x00000008
#define _GLCDCLUT216_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT216_GREEN_LENGTH                0x00000008

#define _GLCDCLUT216_RED_POSITION                0x00000010
#define _GLCDCLUT216_RED_MASK                    0x00FF0000
#define _GLCDCLUT216_RED_LENGTH                  0x00000008

#define _GLCDCLUT217_BLUE_POSITION               0x00000000
#define _GLCDCLUT217_BLUE_MASK                   0x000000FF
#define _GLCDCLUT217_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT217_GREEN_POSITION              0x00000008
#define _GLCDCLUT217_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT217_GREEN_LENGTH                0x00000008

#define _GLCDCLUT217_RED_POSITION                0x00000010
#define _GLCDCLUT217_RED_MASK                    0x00FF0000
#define _GLCDCLUT217_RED_LENGTH                  0x00000008

#define _GLCDCLUT218_BLUE_POSITION               0x00000000
#define _GLCDCLUT218_BLUE_MASK                   0x000000FF
#define _GLCDCLUT218_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT218_GREEN_POSITION              0x00000008
#define _GLCDCLUT218_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT218_GREEN_LENGTH                0x00000008

#define _GLCDCLUT218_RED_POSITION                0x00000010
#define _GLCDCLUT218_RED_MASK                    0x00FF0000
#define _GLCDCLUT218_RED_LENGTH                  0x00000008

#define _GLCDCLUT219_BLUE_POSITION               0x00000000
#define _GLCDCLUT219_BLUE_MASK                   0x000000FF
#define _GLCDCLUT219_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT219_GREEN_POSITION              0x00000008
#define _GLCDCLUT219_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT219_GREEN_LENGTH                0x00000008

